NextFOAM-2404/tutorials/multiphase/interFoam/RAS/electrostaticDeposition/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale         0.001;

vertices
(
        ( -1000 -500  -500 )
        (  1000 -500  -500 )
        (  1000  500  -500 )
        ( -1000  500  -500 )
        ( -1000 -500   500 )
        (  1000 -500   500 )
        (  1000  500   500 )
        ( -1000  500   500 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ( 40 15 15 ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    side-01
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    side-02
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    side-03
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    side-04
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    side-05
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    side-06
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
